#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bervproject/aws-personal-iac/runs/run-XzqmUxgZymcEQDM8

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
aws_ecr_repository.demo_ecr: Refreshing state... [id=demo_ecr]
aws_dynamodb_table.ap-southeast-1: Refreshing state... [id=note]
aws_dynamodb_global_table.note: Refreshing state... [id=note]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_global_table.note has been deleted
  - resource "aws_dynamodb_global_table" "note" {
      - arn  = "arn:aws:dynamodb::092318301320:global-table/note" -> null
      - id   = "note" -> null
      - name = "note" -> null

      - replica {
          - region_name = "ap-southeast-1" -> null
        }
    }

  # aws_dynamodb_table.ap-southeast-1 has been deleted
  - resource "aws_dynamodb_table" "ap-southeast-1" {
      - arn              = "arn:aws:dynamodb:ap-southeast-1:092318301320:table/note" -> null
      - billing_mode     = "PROVISIONED" -> null
      - hash_key         = "id" -> null
      - id               = "note" -> null
      - name             = "note" -> null
      - read_capacity    = 1 -> null
      - stream_arn       = "arn:aws:dynamodb:ap-southeast-1:092318301320:table/note/stream/2022-04-09T09:48:46.963" -> null
      - stream_enabled   = true -> null
      - stream_label     = "2022-04-09T09:48:46.963" -> null
      - stream_view_type = "NEW_AND_OLD_IMAGES" -> null
      - tags             = {
          - "Environment" = "dev"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
        } -> null
      - write_capacity   = 1 -> null

      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - attribute_name = "TimeToExist" -> null
          - enabled        = true -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_global_table.note will be created
  + resource "aws_dynamodb_global_table" "note" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "note"

      + replica {
          + region_name = "ap-southeast-1"
        }
    }

  # aws_dynamodb_table.ap-southeast-1 will be created
  + resource "aws_dynamodb_table" "ap-southeast-1" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "note"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Environment" = "dev"
        }
      + tags_all         = {
          + "Environment" = "dev"
        }
      + write_capacity   = 1

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @berviantoleo, Action: `pull_request`*